sgrzegorz/STM32F4-mp3-player/Src/main.c
  /*Configure GPIO pin : PA0 */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : BOOT1_Pin */
  GPIO_InitStruct.Pin = BOOT1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BOOT1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : CLK_IN_Pin */
  GPIO_InitStruct.Pin = CLK_IN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(CLK_IN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LD4_Pin LD3_Pin LD5_Pin LD6_Pin 
                           Audio_RST_Pin */
  GPIO_InitStruct.Pin = LD4_Pin | LD3_Pin | LD5_Pin | LD6_Pin | Audio_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : MEMS_INT2_Pin */
  GPIO_InitStruct.Pin = MEMS_INT2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);
}

/* USER CODE BEGIN 4 */
FIL file;

const char *FNAME = "haltmich.wav";
extern ApplicationTypeDef Appli_state;
extern USBH_HandleTypeDef hUsbHostHS;

#define AUDIO_BUFFER_SIZE 4096
uint8_t buff[AUDIO_BUFFER_SIZE];
// static uint8_t player_state = 0;
// static uint32_t fpos = 0;

static void f_disp_res(FRESULT r)
{
  switch (r)
  {
  case FR_OK:
    printf("FR_OK\n");
    break;
  case FR_DISK_ERR:
    printf("FR_DISK_ERR\n");
    break;
  case FR_INT_ERR:
    printf("FR_INT_ERR\n");
    break;
  case FR_NOT_READY:
    printf("FR_NOT_READY\n");
    break;
  case FR_NO_FILE:
    printf("FR_NO_FILE\n");
    break;
  case FR_NO_PATH:
    printf("FR_NO_PATH\n");
    break;
  case FR_INVALID_NAME:
    printf("FR_INVALID_NAME\n");
    break;
  case FR_DENIED:
    printf("FR_DENIED\n");
    break;
  case FR_EXIST:
    printf("FR_EXIST\n");
    break;
  case FR_INVALID_OBJECT:
    printf("FR_INVALID_OBJECT\n");
    break;
  case FR_WRITE_PROTECTED:
    printf("FR_WRITE_PROTECTED\n");
    break;
  case FR_INVALID_DRIVE:
    printf("FR_INVALID_DRIVE\n");
    break;
  case FR_NOT_ENABLED:
    printf("FR_NOT_ENABLED\n");
    break;
  case FR_NO_FILESYSTEM:
    printf("FR_NO_FILESYSTEM\n");
    break;
  case FR_MKFS_ABORTED:
    printf("FR_MKFS_ABORTED\n");
    break;
  case FR_TIMEOUT:
    printf("FR_TIMEOUT\n");
    break;
  case FR_LOCKED:
    printf("FR_LOCKED\n");
    break;
  case FR_NOT_ENOUGH_CORE:
    printf("FR_NOT_ENOUGH_CORE\n");
    break;
  case FR_TOO_MANY_OPEN_FILES:
    printf("FR_TOO_MANY_OPEN_FILES\n");
    break;
  case FR_INVALID_PARAMETER:
    printf("FR_INVALID_PARAMETER\n");
    break;
  default:
    printf("result code unknown (%d = 0x%X)\n", r, r);
  }
}

/**
  * @brief  Manages the DMA Half Transfer complete interrupt.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{
  ON(RED);
  buf_offs = BUFFER_OFFSET_HALF;
}

/**
* @brief  Calculates the remaining file size and new position of the pointer.
* @param  None
* @retval None
*/
void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
  OFF(RED);
  buf_offs = BUFFER_OFFSET_FULL;
  BSP_AUDIO_OUT_ChangeBuffer((uint16_t *)&out_buffer[0], OUT_BUFFER_SIZE);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const *argument)
{

  BSP_LED_Init(GREEN);
  BSP_LED_Init(BLUE);
  BSP_LED_Init(ORANGE);
  BSP_LED_Init(RED);

  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for FATFS */
  MX_FATFS_Init();

  /* USER CODE BEGIN 5 */

  HAL_GPIO_WritePin(OTG_FS_PowerSwitchOn_GPIO_Port, OTG_FS_PowerSwitchOn_Pin, GPIO_PIN_RESET);

  vTaskDelay(1000);

  xprintf("waiting for USB mass storage\n");

  do
  {
    xprintf(".");
    vTaskDelay(250);
  } while (Appli_state != APPLICATION_READY);

  char *path = "0:/";
  search_for_songs(path);
  if(mp3FilesCounter<=0){
    xprintf("Number of songs found less or equal 0\n");
    return;
  }

  // char string[256] ="0:/sound.mp3";

  int song_id = 5; //bo akurat piosenka z tym id jest najkrotsza i od niej chcialbym zaczac. Potem usune te linijke
  while (1)
  {
    if(current_state == STOP_STATE){
      xprintf("Playing songs is stopped\n");
      vTaskDelay(2000);
    }else if (current_state == NEXT_STATE)
    {
      song_id++;
      play_mp3(paths[(song_id) % mp3FilesCounter]);
    }else if(current_state == PREVIOUS_STATE){
      song_id--;
      play_mp3(paths[(song_id) % mp3FilesCounter]);
    }
    
  }
  /* Infinite loop */

  // for (;;)
  // {

  //   char key = debug_inkey();

  //   switch(key)
  //   {
  //     case 'p':
  //     {
  //       xprintf("play command...\n");
  //       if(player_state) {xprintf("already playing\n"); break;}
  //       player_state = 1;
  //       BSP_AUDIO_OUT_Play((uint16_t*)&out_buffer[0],OUT_BUFFER_SIZE*2);
  //       read_pointer = read_buffer;
  //       buf_offs = BUFFER_OFFSET_NONE;

  //       break;
  //     }
  //   }

  //   if(player_state)
  //   {
  //     uint32_t br;
  //     mp3_proccess(&file);
  //     vTaskDelay(2);
  //   }

  // /* USER CODE END 5 */
  // }
}

void search_for_songs(char *path)
{

  DIR directory;
  FILINFO info;

  if (f_opendir(&directory, path) != FR_OK)
  {
    xprintf("Error opening the directory\n");
    return;
  }

  while (1)
  {
    if (f_readdir(&directory, &info) != FR_OK)
    {
      xprintf("Error reading from directory\n");
      return;
    }
    if (info.fname[0] == 0)
    {
      break;
    }
    if (strstr(info.fname, ".mp3") || strstr(info.fname, ".MP3"))
    {
      mp3FilesCounter++;
    }
  }

  f_closedir(&directory);

  int i = 0;
  paths = malloc(sizeof(char *) * mp3FilesCounter);

  if (paths == NULL)
  {
    xprintf("Error allocating memory\n");
    return;
  }

