sgrzegorz/STM32F4-mp3-player/Src/main.c
  if (f_opendir(&directory, path) != FR_OK)
  {
    xprintf("Error opening the directory\n");
    return;
  }

  while (1)
  {
    if (f_readdir(&directory, &info) != FR_OK)
    {
      xprintf("Error reading from directory\n");
      return;
    }
    if (info.fname[0] == 0)
      break;
    if (strstr(info.fname, ".mp3") || strstr(info.fname, ".MP3"))
    {
      paths[i] = malloc((strlen(info.fname) + 1) * sizeof(char));
      strcpy(paths[i], info.fname);
      i++;
    }
  }

  f_closedir(&directory);

  xprintf("\n\nNumber of songs: %d \n", mp3FilesCounter);
  for (int i = 0; i < mp3FilesCounter; i++)
  {
    xprintf("paths[%d] %s\n", i, paths[i]);
  }
}

void play_mp3(char *songname)
{
  FRESULT res;

  res = f_open(&file, songname, FA_READ);
  //res = f_open(&file, "0:/sound1.mp3", FA_READ);

  if (res == FR_OK)
  {
    xprintf("mp3 file open OK\n");
  }
  else
  {
    xprintf("mp3 file open ERROR, res = %d\n", res);
    f_disp_res(res);
    while (1)
      ;
  }

  if (BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_AUTO, 70, AUDIO_FREQUENCY_44K) == 0)
  {
    xprintf("Audio Init Ok\n");
  }
  else
  {
    xprintf("Audio Init Error\n");
  }

  hMP3Decoder = MP3InitDecoder();
  read_pointer = NULL;

  current_state = PLAY_STATE;
  playing = SONG_IS_PLAYED_NOW;

  if (mp3_proccess(&file) == 0)
  {
    BSP_AUDIO_OUT_Play((uint16_t *)&out_buffer[0], OUT_BUFFER_SIZE * 2);

    while (1)
    {
      if (playing == SONG_IS_PLAYED_NOW)
      {

        if (buf_offs == BUFFER_OFFSET_HALF || buf_offs == BUFFER_OFFSET_FULL)
        {
          if (mp3_proccess(&file) == END_OF_FILE)
          {
            ON(GREEN);
            playing = SONG_ISNT_PLAYED_NOW;
            current_state = NEXT_STATE;

                if (BSP_AUDIO_OUT_Stop(CODEC_PDWN_HW) != AUDIO_OK)
                {
                  xprintf("BSP_AUDIO_OUT_STOP failed\n");
                }
          }
        }
        vTaskDelay(1);
      }

      handle_key_press_extraputty();

      if (current_state == STOP_STATE || current_state == NEXT_STATE || current_state== PREVIOUS_STATE)
      {
        break;
      }
    }

    if (BSP_AUDIO_OUT_Stop(CODEC_PDWN_HW) != AUDIO_OK)
    {
      xprintf("BSP_AUDIO_OUT_STOP failed\n");
    }
    if(f_close(&file)!=FR_OK){
      xprintf("Failed closing file\n");
    }
  }
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM7 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM7)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}
/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

void handle_key_press_extraputty()
{
  char key = debug_inkey();

  switch (key)
  {
  case 'p':
    if (current_state == PLAY_STATE)
    {
      current_state = PAUSE_STATE;

      if (BSP_AUDIO_OUT_Pause() != AUDIO_OK)
        xprintf("Pause failed\n");

      playing = SONG_ISNT_PLAYED_NOW;
      xprintf("paused\n");
    }
    break;
  case 'r':
    if (current_state == PAUSE_STATE)
    {
      current_state = PLAY_STATE;

      if (BSP_AUDIO_OUT_Resume() != AUDIO_OK)
        xprintf("BSP_AUDIO_IN_Resume failed\n");

      playing = SONG_IS_PLAYED_NOW;
      xprintf("resumed\n");
    }
    break;
  case 's':
    current_state = STOP_STATE;
    playing = SONG_ISNT_PLAYED_NOW;

    xprintf("stopped\n");
    break;
  case 'q':
    //previous
    current_state = PREVIOUS_STATE;
    playing = SONG_ISNT_PLAYED_NOW;
    break;
  case 'w':
    //next
    current_state = NEXT_STATE;
    playing = SONG_ISNT_PLAYED_NOW;
    break;
  default:
    if (key != 0)
      xprintf("%d unknown key\n", key);
    break;
  }
}

int mp3_proccess(FIL *mp3_file)
{
  MP3FrameInfo mp3FrameInfo;
  if (read_pointer == NULL)
  {
    if (refill_inbuffer(mp3_file) != 0)
    {
      xprintf("Returning end of file0\n");

      return END_OF_FILE;
    }
  }

  offset = MP3FindSyncWord(read_pointer, bytes_left);
  while (offset < 0)
  {

    if (refill_inbuffer(mp3_file) != 0)
    {
      xprintf("Returning end of file1\n");
      return END_OF_FILE;
    }
    if (bytes_left > 0)
    {
      bytes_left -= 1;
      read_pointer += 1;
    }
    offset = MP3FindSyncWord(read_pointer, bytes_left);
  }
  read_pointer += offset;
  bytes_left -= offset;

  if (MP3GetNextFrameInfo(hMP3Decoder, &mp3FrameInfo, read_pointer) == 0 &&
      mp3FrameInfo.nChans == 2 &&
      mp3FrameInfo.version == 0)
  {
  }
  else
  {
    if (bytes_left > 0)
    {
      bytes_left -= 1;
      read_pointer += 1;
    }
    return 0;
  }

  if (bytes_left < MAINBUF_SIZE)
  {
    if (refill_inbuffer(mp3_file) != 0)
    {
      xprintf("Returning end of file2\n");
      return END_OF_FILE;
    }
  }

  ON(BLUE);
  if (buf_offs == (BUFFER_OFFSET_HALF))
  {
    result = MP3Decode(hMP3Decoder, &read_pointer, &bytes_left, out_buffer, 0);
    buf_offs = BUFFER_OFFSET_NONE;
  }
  if (buf_offs == (BUFFER_OFFSET_FULL))
  {
    result = MP3Decode(hMP3Decoder, &read_pointer, &bytes_left, &out_buffer[DECODED_MP3_FRAME_SIZE], 0);
    buf_offs = BUFFER_OFFSET_NONE;
  }
  OFF(BLUE);

  if (result != ERR_MP3_NONE)
  {
    switch (result)
    {
    case ERR_MP3_INDATA_UNDERFLOW:
      bytes_left = 0;
      if (refill_inbuffer(mp3_file) != 0)
      {
        xprintf("Returning end of file3\n");

        return END_OF_FILE;
      }
      break;
    case ERR_MP3_MAINDATA_UNDERFLOW:
      //do nothing, next call to MP3Decode will provide more data
      break;
    default:
      return 0; //skip this frame if error
                //return END_OF_FILE; //skip this file if error
    }
  }
  return 0;
}

int refill_inbuffer(FIL *in_file)
{
  unsigned int bytes_read;
  unsigned int bytes_to_read;
  FRESULT result;

  if (bytes_left > 0)
  {

    //copy remaining data to beginning of buffer
    memcpy(read_buffer, read_pointer, bytes_left);
  }

  bytes_to_read = READ_BUFFER_SIZE - bytes_left;

  result = f_read(in_file, (BYTE *)read_buffer + bytes_left, bytes_to_read, &bytes_read);

  if (result != FR_OK)
    return READ_ERROR;

  if (bytes_read == bytes_to_read)
  {
    read_pointer = read_buffer;
    offset = 0;
    bytes_left = READ_BUFFER_SIZE;
    return 0;
  }
  else
  {
    return END_OF_FILE;
  }

  return 0; //should never reach this point
}

#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
